Revit 2024 API
PipeFittingAndAccessoryPressureDropData Methods
The PipeFittingAndAccessoryPressureDropData type exposes the following members.
Methods
Name | Description
Dispose
Equals
Determines whether the specified Object is equal to the current Object.
 (Inherited from Object.)
GetHashCode
Serves as a hash function for a particular type.
 (Inherited from Object.)
GetPipeFittingAndAccessoryData
 Returns the fitting and accessory information
GetPresureDropItems
 Returns the pressure drop items
GetType
Gets the Type of the current instance.
 (Inherited from Object.)
SetDefaultEntity
 Stores the default entity in the data.
ToString
Returns a string that represents the current object.
 (Inherited from Object.)
See Also
PipeFittingAndAccessoryPressureDropData Class
Autodesk.Revit.DB.Plumbing Namespace